{"class_name": "Model", "config": {"name": "model_2", "layers": [{"name": "input_1", "class_name": "InputLayer", "config": {"batch_input_shape": [null, 112, 92, 1], "dtype": "float32", "sparse": false, "name": "input_1"}, "inbound_nodes": []}, {"name": "input_2", "class_name": "InputLayer", "config": {"batch_input_shape": [null, 112, 92, 1], "dtype": "float32", "sparse": false, "name": "input_2"}, "inbound_nodes": []}, {"name": "model_1", "class_name": "Model", "config": {"name": "model_1", "layers": [{"name": "input_3", "class_name": "InputLayer", "config": {"batch_input_shape": [null, 112, 92, 1], "dtype": "float32", "sparse": false, "name": "input_3"}, "inbound_nodes": []}, {"name": "squeeze1/conv1", "class_name": "Conv2D", "config": {"name": "squeeze1/conv1", "trainable": true, "dtype": "float32", "filters": 64, "kernel_size": [3, 3], "strides": [2, 2], "padding": "valid", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["input_3", 0, 0, {}]]]}, {"name": "squeeze1/pool1", "class_name": "MaxPooling2D", "config": {"name": "squeeze1/pool1", "trainable": true, "dtype": "float32", "pool_size": [3, 3], "padding": "valid", "strides": [2, 2], "data_format": "channels_last"}, "inbound_nodes": [[["squeeze1/conv1", 0, 0, {}]]]}, {"name": "squeeze1/fire2/squeeze1x1", "class_name": "Conv2D", "config": {"name": "squeeze1/fire2/squeeze1x1", "trainable": true, "dtype": "float32", "filters": 16, "kernel_size": [1, 1], "strides": [1, 1], "padding": "valid", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["squeeze1/pool1", 0, 0, {}]]]}, {"name": "squeeze1/fire2/squeeze1x1_bn", "class_name": "BatchNormalization", "config": {"name": "squeeze1/fire2/squeeze1x1_bn", "trainable": true, "dtype": "float32", "axis": -1, "momentum": 0.99, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "inbound_nodes": [[["squeeze1/fire2/squeeze1x1", 0, 0, {}]]]}, {"name": "squeeze1/fire2/expand1x1", "class_name": "Conv2D", "config": {"name": "squeeze1/fire2/expand1x1", "trainable": true, "dtype": "float32", "filters": 64, "kernel_size": [1, 1], "strides": [1, 1], "padding": "valid", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["squeeze1/fire2/squeeze1x1_bn", 0, 0, {}]]]}, {"name": "squeeze1/fire2/expand3x3", "class_name": "Conv2D", "config": {"name": "squeeze1/fire2/expand3x3", "trainable": true, "dtype": "float32", "filters": 64, "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["squeeze1/fire2/squeeze1x1_bn", 0, 0, {}]]]}, {"name": "squeeze1/fire2/concat", "class_name": "Concatenate", "config": {"name": "squeeze1/fire2/concat", "trainable": true, "dtype": "float32", "axis": 3}, "inbound_nodes": [[["squeeze1/fire2/expand1x1", 0, 0, {}], ["squeeze1/fire2/expand3x3", 0, 0, {}]]]}, {"name": "squeeze1/fire3/squeeze1x1", "class_name": "Conv2D", "config": {"name": "squeeze1/fire3/squeeze1x1", "trainable": true, "dtype": "float32", "filters": 16, "kernel_size": [1, 1], "strides": [1, 1], "padding": "valid", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["squeeze1/fire2/concat", 0, 0, {}]]]}, {"name": "squeeze1/fire3/squeeze1x1_bn", "class_name": "BatchNormalization", "config": {"name": "squeeze1/fire3/squeeze1x1_bn", "trainable": true, "dtype": "float32", "axis": -1, "momentum": 0.99, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "inbound_nodes": [[["squeeze1/fire3/squeeze1x1", 0, 0, {}]]]}, {"name": "squeeze1/fire3/expand1x1", "class_name": "Conv2D", "config": {"name": "squeeze1/fire3/expand1x1", "trainable": true, "dtype": "float32", "filters": 64, "kernel_size": [1, 1], "strides": [1, 1], "padding": "valid", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["squeeze1/fire3/squeeze1x1_bn", 0, 0, {}]]]}, {"name": "squeeze1/fire3/expand3x3", "class_name": "Conv2D", "config": {"name": "squeeze1/fire3/expand3x3", "trainable": true, "dtype": "float32", "filters": 64, "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["squeeze1/fire3/squeeze1x1_bn", 0, 0, {}]]]}, {"name": "squeeze1/fire3/concat", "class_name": "Concatenate", "config": {"name": "squeeze1/fire3/concat", "trainable": true, "dtype": "float32", "axis": 3}, "inbound_nodes": [[["squeeze1/fire3/expand1x1", 0, 0, {}], ["squeeze1/fire3/expand3x3", 0, 0, {}]]]}, {"name": "squeeze1/fire4/squeeze1x1", "class_name": "Conv2D", "config": {"name": "squeeze1/fire4/squeeze1x1", "trainable": true, "dtype": "float32", "filters": 32, "kernel_size": [1, 1], "strides": [1, 1], "padding": "valid", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["squeeze1/fire3/concat", 0, 0, {}]]]}, {"name": "squeeze1/fire4/squeeze1x1_bn", "class_name": "BatchNormalization", "config": {"name": "squeeze1/fire4/squeeze1x1_bn", "trainable": true, "dtype": "float32", "axis": -1, "momentum": 0.99, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "inbound_nodes": [[["squeeze1/fire4/squeeze1x1", 0, 0, {}]]]}, {"name": "squeeze1/fire4/expand1x1", "class_name": "Conv2D", "config": {"name": "squeeze1/fire4/expand1x1", "trainable": true, "dtype": "float32", "filters": 128, "kernel_size": [1, 1], "strides": [1, 1], "padding": "valid", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["squeeze1/fire4/squeeze1x1_bn", 0, 0, {}]]]}, {"name": "squeeze1/fire4/expand3x3", "class_name": "Conv2D", "config": {"name": "squeeze1/fire4/expand3x3", "trainable": true, "dtype": "float32", "filters": 128, "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["squeeze1/fire4/squeeze1x1_bn", 0, 0, {}]]]}, {"name": "squeeze1/fire4/concat", "class_name": "Concatenate", "config": {"name": "squeeze1/fire4/concat", "trainable": true, "dtype": "float32", "axis": 3}, "inbound_nodes": [[["squeeze1/fire4/expand1x1", 0, 0, {}], ["squeeze1/fire4/expand3x3", 0, 0, {}]]]}, {"name": "squeeze1/fire5/squeeze1x1", "class_name": "Conv2D", "config": {"name": "squeeze1/fire5/squeeze1x1", "trainable": true, "dtype": "float32", "filters": 32, "kernel_size": [1, 1], "strides": [1, 1], "padding": "valid", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["squeeze1/fire4/concat", 0, 0, {}]]]}, {"name": "squeeze1/fire5/squeeze1x1_bn", "class_name": "BatchNormalization", "config": {"name": "squeeze1/fire5/squeeze1x1_bn", "trainable": true, "dtype": "float32", "axis": -1, "momentum": 0.99, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "inbound_nodes": [[["squeeze1/fire5/squeeze1x1", 0, 0, {}]]]}, {"name": "squeeze1/fire5/expand1x1", "class_name": "Conv2D", "config": {"name": "squeeze1/fire5/expand1x1", "trainable": true, "dtype": "float32", "filters": 128, "kernel_size": [1, 1], "strides": [1, 1], "padding": "valid", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["squeeze1/fire5/squeeze1x1_bn", 0, 0, {}]]]}, {"name": "squeeze1/fire5/expand3x3", "class_name": "Conv2D", "config": {"name": "squeeze1/fire5/expand3x3", "trainable": true, "dtype": "float32", "filters": 128, "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["squeeze1/fire5/squeeze1x1_bn", 0, 0, {}]]]}, {"name": "squeeze1/fire5/concat", "class_name": "Concatenate", "config": {"name": "squeeze1/fire5/concat", "trainable": true, "dtype": "float32", "axis": 3}, "inbound_nodes": [[["squeeze1/fire5/expand1x1", 0, 0, {}], ["squeeze1/fire5/expand3x3", 0, 0, {}]]]}, {"name": "squeeze1/pool5", "class_name": "MaxPooling2D", "config": {"name": "squeeze1/pool5", "trainable": true, "dtype": "float32", "pool_size": [3, 3], "padding": "valid", "strides": [2, 2], "data_format": "channels_last"}, "inbound_nodes": [[["squeeze1/fire5/concat", 0, 0, {}]]]}, {"name": "squeeze1/fire6/squeeze1x1", "class_name": "Conv2D", "config": {"name": "squeeze1/fire6/squeeze1x1", "trainable": true, "dtype": "float32", "filters": 48, "kernel_size": [1, 1], "strides": [1, 1], "padding": "valid", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["squeeze1/pool5", 0, 0, {}]]]}, {"name": "squeeze1/fire6/squeeze1x1_bn", "class_name": "BatchNormalization", "config": {"name": "squeeze1/fire6/squeeze1x1_bn", "trainable": true, "dtype": "float32", "axis": -1, "momentum": 0.99, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "inbound_nodes": [[["squeeze1/fire6/squeeze1x1", 0, 0, {}]]]}, {"name": "squeeze1/fire6/expand1x1", "class_name": "Conv2D", "config": {"name": "squeeze1/fire6/expand1x1", "trainable": true, "dtype": "float32", "filters": 192, "kernel_size": [1, 1], "strides": [1, 1], "padding": "valid", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["squeeze1/fire6/squeeze1x1_bn", 0, 0, {}]]]}, {"name": "squeeze1/fire6/expand3x3", "class_name": "Conv2D", "config": {"name": "squeeze1/fire6/expand3x3", "trainable": true, "dtype": "float32", "filters": 192, "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["squeeze1/fire6/squeeze1x1_bn", 0, 0, {}]]]}, {"name": "squeeze1/fire6/concat", "class_name": "Concatenate", "config": {"name": "squeeze1/fire6/concat", "trainable": true, "dtype": "float32", "axis": 3}, "inbound_nodes": [[["squeeze1/fire6/expand1x1", 0, 0, {}], ["squeeze1/fire6/expand3x3", 0, 0, {}]]]}, {"name": "squeeze1/fire7/squeeze1x1", "class_name": "Conv2D", "config": {"name": "squeeze1/fire7/squeeze1x1", "trainable": true, "dtype": "float32", "filters": 48, "kernel_size": [1, 1], "strides": [1, 1], "padding": "valid", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["squeeze1/fire6/concat", 0, 0, {}]]]}, {"name": "squeeze1/fire7/squeeze1x1_bn", "class_name": "BatchNormalization", "config": {"name": "squeeze1/fire7/squeeze1x1_bn", "trainable": true, "dtype": "float32", "axis": -1, "momentum": 0.99, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "inbound_nodes": [[["squeeze1/fire7/squeeze1x1", 0, 0, {}]]]}, {"name": "squeeze1/fire7/expand1x1", "class_name": "Conv2D", "config": {"name": "squeeze1/fire7/expand1x1", "trainable": true, "dtype": "float32", "filters": 192, "kernel_size": [1, 1], "strides": [1, 1], "padding": "valid", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["squeeze1/fire7/squeeze1x1_bn", 0, 0, {}]]]}, {"name": "squeeze1/fire7/expand3x3", "class_name": "Conv2D", "config": {"name": "squeeze1/fire7/expand3x3", "trainable": true, "dtype": "float32", "filters": 192, "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["squeeze1/fire7/squeeze1x1_bn", 0, 0, {}]]]}, {"name": "squeeze1/fire7/concat", "class_name": "Concatenate", "config": {"name": "squeeze1/fire7/concat", "trainable": true, "dtype": "float32", "axis": 3}, "inbound_nodes": [[["squeeze1/fire7/expand1x1", 0, 0, {}], ["squeeze1/fire7/expand3x3", 0, 0, {}]]]}, {"name": "squeeze1/fire8/squeeze1x1", "class_name": "Conv2D", "config": {"name": "squeeze1/fire8/squeeze1x1", "trainable": true, "dtype": "float32", "filters": 64, "kernel_size": [1, 1], "strides": [1, 1], "padding": "valid", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["squeeze1/fire7/concat", 0, 0, {}]]]}, {"name": "squeeze1/fire8/squeeze1x1_bn", "class_name": "BatchNormalization", "config": {"name": "squeeze1/fire8/squeeze1x1_bn", "trainable": true, "dtype": "float32", "axis": -1, "momentum": 0.99, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "inbound_nodes": [[["squeeze1/fire8/squeeze1x1", 0, 0, {}]]]}, {"name": "squeeze1/fire8/expand1x1", "class_name": "Conv2D", "config": {"name": "squeeze1/fire8/expand1x1", "trainable": true, "dtype": "float32", "filters": 256, "kernel_size": [1, 1], "strides": [1, 1], "padding": "valid", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["squeeze1/fire8/squeeze1x1_bn", 0, 0, {}]]]}, {"name": "squeeze1/fire8/expand3x3", "class_name": "Conv2D", "config": {"name": "squeeze1/fire8/expand3x3", "trainable": true, "dtype": "float32", "filters": 256, "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["squeeze1/fire8/squeeze1x1_bn", 0, 0, {}]]]}, {"name": "squeeze1/fire8/concat", "class_name": "Concatenate", "config": {"name": "squeeze1/fire8/concat", "trainable": true, "dtype": "float32", "axis": 3}, "inbound_nodes": [[["squeeze1/fire8/expand1x1", 0, 0, {}], ["squeeze1/fire8/expand3x3", 0, 0, {}]]]}, {"name": "squeeze1/fire9/squeeze1x1", "class_name": "Conv2D", "config": {"name": "squeeze1/fire9/squeeze1x1", "trainable": true, "dtype": "float32", "filters": 64, "kernel_size": [1, 1], "strides": [1, 1], "padding": "valid", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["squeeze1/fire8/concat", 0, 0, {}]]]}, {"name": "squeeze1/fire9/squeeze1x1_bn", "class_name": "BatchNormalization", "config": {"name": "squeeze1/fire9/squeeze1x1_bn", "trainable": true, "dtype": "float32", "axis": -1, "momentum": 0.99, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "inbound_nodes": [[["squeeze1/fire9/squeeze1x1", 0, 0, {}]]]}, {"name": "squeeze1/fire9/expand1x1", "class_name": "Conv2D", "config": {"name": "squeeze1/fire9/expand1x1", "trainable": true, "dtype": "float32", "filters": 256, "kernel_size": [1, 1], "strides": [1, 1], "padding": "valid", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["squeeze1/fire9/squeeze1x1_bn", 0, 0, {}]]]}, {"name": "squeeze1/fire9/expand3x3", "class_name": "Conv2D", "config": {"name": "squeeze1/fire9/expand3x3", "trainable": true, "dtype": "float32", "filters": 256, "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["squeeze1/fire9/squeeze1x1_bn", 0, 0, {}]]]}, {"name": "squeeze1/fire9/concat", "class_name": "Concatenate", "config": {"name": "squeeze1/fire9/concat", "trainable": true, "dtype": "float32", "axis": 3}, "inbound_nodes": [[["squeeze1/fire9/expand1x1", 0, 0, {}], ["squeeze1/fire9/expand3x3", 0, 0, {}]]]}, {"name": "squeeze1/dropout9", "class_name": "Dropout", "config": {"name": "squeeze1/dropout9", "trainable": true, "dtype": "float32", "rate": 0.5, "noise_shape": null, "seed": null}, "inbound_nodes": [[["squeeze1/fire9/concat", 0, 0, {}]]]}, {"name": "squeeze1/conv10", "class_name": "Conv2D", "config": {"name": "squeeze1/conv10", "trainable": true, "dtype": "float32", "filters": 1000, "kernel_size": [1, 1], "strides": [1, 1], "padding": "valid", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["squeeze1/dropout9", 0, 0, {}]]]}, {"name": "squeeze1/conv10_bn", "class_name": "BatchNormalization", "config": {"name": "squeeze1/conv10_bn", "trainable": true, "dtype": "float32", "axis": -1, "momentum": 0.99, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "inbound_nodes": [[["squeeze1/conv10", 0, 0, {}]]]}, {"name": "squeeze1/pool10", "class_name": "GlobalAveragePooling2D", "config": {"name": "squeeze1/pool10", "trainable": true, "dtype": "float32", "data_format": "channels_last"}, "inbound_nodes": [[["squeeze1/conv10_bn", 0, 0, {}]]]}, {"name": "dense1", "class_name": "Dense", "config": {"name": "dense1", "trainable": true, "dtype": "float32", "units": 128, "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["squeeze1/pool10", 0, 0, {}]]]}, {"name": "dropout1", "class_name": "Dropout", "config": {"name": "dropout1", "trainable": true, "dtype": "float32", "rate": 0.1, "noise_shape": null, "seed": null}, "inbound_nodes": [[["dense1", 0, 0, {}]]]}, {"name": "dense2", "class_name": "Dense", "config": {"name": "dense2", "trainable": true, "dtype": "float32", "units": 128, "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["dropout1", 0, 0, {}]]]}], "input_layers": [["input_3", 0, 0]], "output_layers": [["dense2", 0, 0]]}, "inbound_nodes": [[["input_1", 0, 0, {}]], [["input_2", 0, 0, {}]]]}, {"name": "lambda_1", "class_name": "Lambda", "config": {"name": "lambda_1", "trainable": true, "dtype": "float32", "function": ["4wEAAAAAAAAABAAAAAUAAABDAAAAczgAAAB8AFwCfQF9AnQAagF0AGoCfAF8AhgAgwFkAWQCZAON\nA30DdABqA3QAagR8A3QAagWDAIMCgwFTACkETukBAAAAVCkC2gRheGlz2ghrZWVwZGltcykG2gFL\n2gNzdW3aBnNxdWFyZdoEc3FydNoHbWF4aW11bdoHZXBzaWxvbikE2gV2ZWN0c9oBeNoBedoKc3Vt\nX3NxdWFyZakAcg4AAAD6DS5cdHJhaW5pbmcucHnaEmV1Y2xpZGVhbl9kaXN0YW5jZR0AAABzBgAA\nAAABCAEaAQ==\n", null, null], "function_type": "lambda", "output_shape": ["4wEAAAAAAAAAAwAAAAIAAABDAAAAcxQAAAB8AFwCfQF9AnwBZAEZAGQCZgJTACkDTukAAAAA6QEA\nAACpACkD2gZzaGFwZXPaBnNoYXBlMdoGc2hhcGUycgMAAAByAwAAAPoNLlx0cmFpbmluZy5wedoW\nZXVjbF9kaXN0X291dHB1dF9zaGFwZSMAAABzBAAAAAABCAE=\n", null, null], "output_shape_type": "lambda", "arguments": {}}, "inbound_nodes": [[["model_1", 1, 0, {}], ["model_1", 2, 0, {}]]]}], "input_layers": [["input_1", 0, 0], ["input_2", 0, 0]], "output_layers": [["lambda_1", 0, 0]]}, "keras_version": "2.3.1", "backend": "tensorflow"}